from senguo_im.core.describe_enum import DescribedEnum


class SmsSceneEnum(DescribedEnum):
    """
    短信发送场景枚举，应用于senguo-bury.sms_record_gather的sms_id
    """
    聊天消息未读提醒 = 1, "聊天消息未读提醒"
    短信验证码 = 2, "短信验证码"
    供货商结算 = 3, "供货商结算"
    未付款结算记录销账 = 4, "未付款结算记录销账"
    邀请货主注册短信 = 5, "邀请货主注册短信"
    收银台结算客户还款 = 6, "收银台结算客户还款"
    收银台结算客户赊账 = 7, "收银台结算客户赊账"
    收银台结算正常收银结算 = 8, "收银台结算正常收银结算"
    收银台结算退款 = 9, "收银台结算退款"
    赊账退单 = 10, "赊账退单"
    收银台发送欠款详情 = 11, "收银台发送欠款详情"
    批发后台发送欠款详情 = 12, "批发后台发送欠款详情"
    批发后台发送新增欠款详情 = 13, "批发后台发送新增欠款详情"
    老板助手发送欠款详情 = 14, "老板助手发送欠款详情"
    会员充值 = 15, "会员充值"
    档口送货发送货品送货到达详情 = 16, "档口送货发送货品送货到达详情"
    批发后台发送新增全款缴纳提醒 = 17, "批发后台发送新增全款缴纳提醒"
    短信营销活动群发短信通知 = 18, "短信营销活动群发短信通知"
    批发年费缴纳提醒 = 19, "批发后台发送新增全款缴纳提醒"
    采购助手提醒开启在线还款 = 20, "采购助手提醒开启在线还款"
    商家查看微信支付分 = 21, "商家查看微信支付分"
    店铺认领通过 = 22, "店铺认领通过"
    通讯录推荐 = 23, "通讯录推荐"
    批发易发送领卡邀请 = 24, "批发易发送领卡邀请"
    提醒店铺认领通知 = 25, "提醒店铺认领通知"


class SmsSendModeEnum(DescribedEnum):
    """
    短信发送模式枚举，应用于senguo-bury.sms_record_gather的send_mode
    """
    MANUAL = 1, "客户手动发送"
    SYSTEM_AUTO = 2, "系统自动发送"
